let x = [3, -1, 8, 0, 2]; 
    index: 0, 1, 2 
element:1, "2", true


console.log(x[3]);
console.log(x[-1]);
console.log(x[8]); 
console.log(x[0]); 
console.log(x[2]); 



 























// 1. let array = [3, -1, 8, 0, 2]; array -ийн элементүүдийн нийлбэрийг ол
// 2. Хүмүүсийн төрсөн онууд өгөгдсөн бол насуудыг бодож гарга.
// let birthYear = [1994, 1997, 2003, 1993, 2001]

// 3. Array -н бүх утгыг 2 дахин ихэсгэ.
// let a = [1, 2, 3, 4]

// 4. Array-н тэгш элемэнтүүдийн тоог ол. let a = [1, 2, 3, 4]

// 5. Сондгой элементүүдийн index -ийг буюу байрлалыг ол. let a = [1, 2, 3, 4]